package database

func GetFirstNames() []string {
	return []string{
		"ivan", "matvey", "vitaly",
		"artem", "alexander", "roman",
		"evgeny", "maksim", "denis",
		"alexey", "dmitry", "sergey",
		"nikolai", "konstantin", "nikita",
		"mikhail", "boris", "victor",
		"gennady", "vyacheslav", "vladimir",
		"andrei", "anatoly", "ilya",
		"kirill", "oleg", "sofia",
		"anastasia", "victoria", "ksenia",
		"arina", "elizaveta", "adelina",
		"irina", "elena", "polina",
		"daria", "natalia", "svetlana",
		"vera", "nadezhda", "galina",
		"lubov", "alexandra", "maria",
		"anna", "angelina", "marina",
		"ekaterina", "ludmila", "tatyana",
	}
}

func GetSecondNames() []string {
	return []string{
		"ivanov", "kuznetsov", "petrov",
		"smirnov", "magomedov", "popov",
		"volkov", "morozov", "novikov",
		"pavlov", "andreev", "vasilyev",
		"romanov", "makarov", "lebedev",
		"kozlov", "egorov", "zakharov",
		"stepanov", "nikitin", "orlov",
	}
}

func GetMails() []string {
	return []string{
		"gmail.com", "dvfu.ru", "mail.ru",
		"yandex.ru", "protonmail.com", "outlook.com",
	}
}

func GetDishes() [][]string {
	return [][]string{
		{
			// Завтраки
			"Каша рисовая молочная (карамель)",
			"Каша рисовая молочная (шоколад)",
			"Каша рисовая молочная (апельсин)",
			"Каша овсяная молочная (персик)",
			"Каша овсяная молочная (ананас)",
			"Завтрак рыбный с малосольным лососем и яйцом пашот на вафельном дранике",
			"Завтрак мясной с котлетой, маринованными огурчиками и яичницой глазуньей",
			"Завтрак с курицей в панировке и помидорами",
		},
		{
			// Салаты
			"Салат с курицей (аля цезарь)",
			"Салат по-гречески",
			"Поке с лососем",
			"Поке с курицей",
			"Салат с запеченной свеклой",
			"Салат с куриной печенью",
			"Баклажаны в азиатском стиле",
		},
		{
			// Супы
			"Том Ям",
			"Том Кха",
			"Сливочный грибной с сухариками",
			"Гороховый с копченостями",
			"Куриный с лапшой",
			"Уха по-фински",
			"Куриный с яйцом",
		},
		{
			// Вторые блюда
			"Фетучини карбонара",
			"Фетучини болоньез",
			"Гуляш с гарниром",
			"Язык с гарниром",
			"Курица в панировке с картофельными дольками Комбо",
			"Курица в азиатском стиле",
			"Плов",
			"Рагу в азиатском стиле",
			"Биточки из лосося с гарниром",
			"Биточки куриные с гарниром",
		},
		{
			// Выпечка
			"Пян-се",
			"Синабон",
			"Печенье Бискотти",
			"Печенье Кантучи",
			"Тарт ягодный",
			"Тарт цитрусовый",
			"Улитка",
			"Ромовая баба",
			"Кекс рождественский",
			"Кекс лимонный",
			"Овсяное печенье",
		},
		{
			// Десерты
			"Тарталетка вишня-шоколад",
			"Тарталетка фисташка-малина",
			"Тарталетка лимонная",
			"Чиа пуддинг",
			"Меренговый рулет",
			"Дамские пальчики",
			"Пироженное картошка",
			"Заварное колицо",
			"Панакота с малиной",
		},
		{
			// Пицца
			"Пепперони",
			"Три сыра",
			"Курица и грибы",
			"Маргарита",
			"Гавайская",
		},
	}
}

func GetBannerPaths() []string {
	return []string{
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
	}
}

func GetDishCategories() []string {
	return []string{
		"Завтраки",
		"Салаты",
		"Супы",
		"Вторые блюда",
		"Выпечка",
		"Десерты",
		"Пицца",
	}
}
